Final Project/code/3D/mach-3-diamond/system/blockMeshDict
// Diamond Airfoil Mesh Generation 3D
// Parameters:
// L (chord) = 1.0
// b (span) = 1.0
// Theta (deflection angle)  =  10.0
// DL (fore)  =  1.0
// DR  (wake) =  1.5
// H  (top/bottom) = 1.0
// DZ (z-extension) = 1.0

/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


// Indices : 4 7 10 13 20 23 26 29 are not used.

vertices
(   
     (5.0000000000000e-01 0.000000e+00 -5.0000000000000e-01) // 0
     (3.0616169978684e-17 8.816349e-02 -5.0000000000000e-01) // 1
     (-5.0000000000000e-01 1.079691e-17 -5.0000000000000e-01) // 2
     (-9.1848509936051e-17 -8.816349e-02 -5.0000000000000e-01) // 3
     (2.0000000000000e+00 0.000000e+00 -1.5000000000000e+00) // 4
     (2.0000000000000e+00 1.088163e+00 -1.5000000000000e+00) // 5
     (5.0000000000000e-01 1.088163e+00 -1.5000000000000e+00) // 6
     (3.0616169978684e-17 1.088163e+00 -1.5000000000000e+00) // 7
     (-5.0000000000000e-01 1.088163e+00 -1.5000000000000e+00) // 8
     (-1.5000000000000e+00 1.088163e+00 -1.5000000000000e+00) // 9
     (-1.5000000000000e+00 1.332616e-16 -1.5000000000000e+00) // 10
     (-1.5000000000000e+00 -1.088163e+00 -1.5000000000000e+00) // 11
     (-5.0000000000000e-01 -1.088163e+00 -1.5000000000000e+00) // 12
     (-3.0616169978684e-17 -1.088163e+00 -1.5000000000000e+00) // 13
     (5.0000000000000e-01 -1.088163e+00 -1.5000000000000e+00) // 14
     (2.0000000000000e+00 -1.088163e+00 -1.5000000000000e+00) // 15
     (5.0000000000000e-01 0.000000e+00 5.0000000000000e-01) // 16
     (3.0616169978684e-17 8.816349e-02 5.0000000000000e-01) // 17
     (-5.0000000000000e-01 1.079691e-17 5.0000000000000e-01) // 18
     (-9.1848509936051e-17 -8.816349e-02 5.0000000000000e-01) // 19
     (2.0000000000000e+00 0.000000e+00 1.5000000000000e+00) // 20
     (2.0000000000000e+00 1.088163e+00 1.5000000000000e+00) // 21
     (5.0000000000000e-01 1.088163e+00 1.5000000000000e+00) // 22
     (3.0616169978684e-17 1.088163e+00 1.5000000000000e+00) // 23
     (-5.0000000000000e-01 1.088163e+00 1.5000000000000e+00) // 24
     (-1.5000000000000e+00 1.088163e+00 1.5000000000000e+00) // 25
     (-1.5000000000000e+00 1.332616e-16 1.5000000000000e+00) // 26
     (-1.5000000000000e+00 -1.088163e+00 1.5000000000000e+00) // 27
     (-5.0000000000000e-01 -1.088163e+00 1.5000000000000e+00) // 28
     (-3.0616169978684e-17 -1.088163e+00 1.5000000000000e+00) // 29
     (5.0000000000000e-01 -1.088163e+00 1.5000000000000e+00) // 30
     (2.0000000000000e+00 -1.088163e+00 1.5000000000000e+00) // 31
);

blocks
(
    hex (0 1 2 3 16 17 18 19) (96 32 48) simpleGrading (1 1 1) // diamond block
    hex (11 12 8 9 27 28 24 25) (48 48 72) simpleGrading (1 1 1) // fore domain block
    hex (12 14 6 8 28 30 22 24) (120 48 72) simpleGrading (1 1 1) // mid domain block
    hex (14 15 5 6 30 31 21 22) (72 48 72) simpleGrading (1 1 1) // aft domain block

    // Feel free to play with the number of points Nx, Ny, Nz along axes of blocks for refinement
); 


edges
(
);



boundary
(
    inlet
    {
        type patch;
        faces
        (
            (11 27 25 9)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (15 31 21 5)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (11 27 28 12)
            (12 28 30 14)
            (14 30 31 15)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (9 25 24 8)
            (8 24 22 6)
            (6 22 21 5)
        );
    }

    obstacle
    {
        type patch;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
            (3 19 16 0)
        );
    }
);


mergePatchPairs
(
);
